Revit 2027 API
IFCExtrusionCreationData.CustomAxis Property
 The custom extrusion axis to try when generating an extrusion.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ CustomAxis { get; set; }
Public Property CustomAxis As XYZ
	Get
	Set
public:
property XYZ^ CustomAxis {
	XYZ^ get ();
	void set (XYZ^ value);
}
member CustomAxis : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
IFCExtrusionCreationData Class
Autodesk.Revit.DB.IFC Namespace